Repository: arashasg/Persian-Summarizer
Catalog: django_web_based_panel/processnlp/locale/*/LC_MESSAGES/django.po
Languages: fa

source: You must either upload a file or fill the text field.
fa: شما می بایست یا یک فایل txt آپلود کنید یا در متن خود را در کادر بالا وارد کنید.

source: Original text
fa: متن اصلی

source: Nlp model number
fa: شماره مدل nlp

source: Summary
fa: نتیجه

source: Datetime created
fa: تاریخ و زمان ایجاد

source: Datetime modified
fa: تاریخ و زمان تغییر

source: Processing time
fa: زمان پردازش

source: Nlp model
fa: مدل nlp

source: Nlp models
fa: مدل های nlp

source: Natural language processing
fa: پردازش زبان طبیعی

source: Or
fa: یا

source: process
fa: پردازش کن

source: Result
fa: نتیجه

source: back to previous page
fa: بازگشت به صفحه ی قبل
