from typing import Optional

import torch
import uvicorn
from datasets import Dataset
from fastapi import Request, FastAPI
from helper_bert2bert import Helper
from pydantic import BaseModel

helper = Helper("/content/drive/MyDrive/model/outputs/checkpoint-18138", do_tr_lowercase=False, source_prefix="",
                       max_source_length=512,
                       max_target_length=120, num_beams=4, ngram_blocking_size=3, early_stopping=None,
                       use_cuda=torch.cuda.is_available(),
                       batch_size=1, language="fa")

text = '''به گزارش گروه بین‌الملل خبرگزاری تسنیم به نقل از نشریه "دی سایت" آلمان، با توجه به افزایش قیمت انرژی و غذا در آلمان، "لیزا پاوس"، وزیر فدرال امور خانواده در این کشور نسبت به افزایش فقر کودکان هشدار داد.

پاوس به شبکه تحریریه آلمان گفت: خطر افزایش فقر کودکان بسیار زیاد است. وی خواستار اقداماتی برای بهبود شرایط شد. پاوس گفت که بسیاری از مردم، به ویژه خانواده های دارای فرزند، به دلیل تحولات قیمت با پشت به دیوار ایستاده اند و مسئله موجودیت آن ها مطرح است.

این مقام آلمانی تاکید کرد: سیستم محاسبات فعلی برای وضعیت پویایی مانند آنچه در حال حاضر داریم مناسب نیست. ما باید روی آن کار کنیم. وی این را مهم دانست که نرخ استاندارد نه تنها برای بزرگسالان بلکه برای کودکان نیز افزایش یابد.

پاوس مجدداً خواستار افزایش قابل توجه کمک هزینه کودکان برای کمک به خانواده ها در زمان تورم بالا شد. وزیر امور خانواده افزایش کمک هزینه کودکان را که توسط وزارت دارایی برنامه ریزی شده است، برای جبران تورم ناکافی دانسته و گفت: ما باید آن را بهبود بخشیم. وی افزود: علاوه بر این، افزایش کمک هزینه فرزند باید در یک مفهوم کلی گنجانده شود که از طریق آن خانواده‌ها در جاهای دیگر نیز حمایت می‌شوند.

نمایندگان سازمان جوانان حزب سوسیال دموکرات آلمان هم هشدار دادند که هزینه های بالای انرژی می تواند جوانان و حتی افراد با درآمد متوسط ​​را به مارپیچ فقر بکشاند. "جسیکا روزنتال"، رئیس این سازمان و معاونش "مانون لوتر" خواستار تعیین سقف برای قیمت گاز شده اند. آنها در مورد طرح عوارض گاز نظر منفی و مخالف دارند. روزنتال به راینیشه پست گفت، رابرت هابک، وزیر اقتصاد فدرال آلمان به این ترتیب سیاست های ناعادلانه اجتماعی را اجرا می کند.

خانوارهای آلمانی پس از اعمال عوارضی که با هدف کمک به پوشش هزینه نیروگاه‌ها تعیین شد، ناچارند تقریبا 500 یورو (509 دلار) پول بیشتری در سال برای گاز پرداخت کنند.

اپراتور بازار گاز آلمان (تردینگ هاب یورو)، روز دوشنبه اعلام کرد هزینه 2.419 یورو به ازای هر کیلووات ساعت را تعیین کرده است. این عوارض از اول اکتبر اعمال خواهد شد و تا آوریل سال 2024 به قوت خود می‌ماند تا به شرکت یونی‌پر و سایر واردکنندگان گاز کمک کند تا در برابر افزایش قیمت‌های انرژی، دوام بیاورند.

اقتصاددانان هشدار دادند که این عوارض، به رشد تورم آلمان که بزرگترین اقتصاد اروپا به شمار می‌رود، شتاب خواهد بخشید. نرخ تورم این کشور اکنون به 8.5 درصد رسیده است'''.replace('\n', '')

inp_dict = {"input": [text]}
test_data = Dataset.from_dict(inp_dict)
test_data = test_data.map(
    helper.preprocess_function,
    batched=True,
    load_from_cache_file=False
)
result = test_data.map(helper.generate_summary, batched=True, batch_size=helper.batch_size,
                        load_from_cache_file=False)

print({"summary": result['predictions'][0]})

